BasicOfScalaAndSpark/README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">1. Introduction</a></li>
<li><a href="#orgheadline1">2. What is spark</a></li>
<li><a href="#orgheadline2">3. Tutorial</a></li>
<li><a href="#orgheadline3">4. Project description</a></li>
</ul>
</div>
</div>

# Introduction<a id="orgheadline4"></a>

In order to start our spark and scala back end project. Some basic understand of spark is necessary. Hence, The first park of this repo will be my understanding about the spark system. And the second part of this repo will be an tutorial I made for the scala and spark. Then, From the third part on will be the true beginning of our back end project.

---

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Section</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Content</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">[2](#orgheadline1)</td>
<td class="org-left">Basic description of the spark system</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-left">[3](#orgheadline2)</td>
<td class="org-left">An runnable spark tutorial (Scala)</td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-left">[4](#orgheadline3)</td>
<td class="org-left">Describe the project structure and API in detail</td>
</tr>
</tbody>
</table>

# What is spark<a id="orgheadline1"></a>

# Tutorial<a id="orgheadline2"></a>

# Project description<a id="orgheadline3"></a>
